arch-linux-mirrorlist-by-country.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-07-07 五 15:24 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How to Update Arch Linux Mirrorlist by Country</title>
<meta name="author" content="ChanMo" />
<meta name="description" content="This article provides instructions on how to update the Arch Linux mirrorlist by country. The mirrorlist is a list of servers that Arch Linux uses to download packages. By updating the mirrorlist, you can ensure that you are using the most up-to-date and reliable mirrors for your country." />
<meta name="keywords" content="ArchLinux, mirrorlist, reflector" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bulma@0.9.4/css/bulma.min.css'><link rel='stylesheet' href='app.css'>
</head>
<body>
<div id="preamble" class="status">
<nav class='navbar is-primary'></nav>
</div>
<div id="content" class="content">
<h1 class="title">How to Update Arch Linux Mirrorlist by Country</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8a89ee1">1. Install reflector</a></li>
<li><a href="#org311be1c">2. Generate a new mirrorlist for your country</a></li>
<li><a href="#org89c7f8a">3. Here are some additional tips for refreshing your mirrorlist:</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8a89ee1" class="outline-2">
<h2 id="org8a89ee1"><span class="section-number-2">1.</span> Install reflector</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
sudo pacman -S reflector
</pre>
</div>
</div>

<div id="outline-container-org311be1c" class="outline-2">
<h2 id="org311be1c"><span class="section-number-2">2.</span> Generate a new mirrorlist for your country</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
reflector --country &lt;country code&gt; --latest 5 --sort rate --save /etc/pacman.d/mirrorlist
</pre>

<p>
Replace <code>&lt;country code&gt;</code> with the two-letter country code for the country
you want to refresh.
For example, to refresh the mirrorlist for the United States,
you would run the following command:
</p>

<pre class="example">
reflector --country US --latest 5 --sort rate --save /etc/pacman.d/mirrorlist
</pre>

<p>
Once the new mirrorlist has been generated,
you can force pacman to refresh the package lists by running the following
command:
</p>

<pre class="example">
pacman -Syyu --refresh
</pre>

<p>
This will ensure that you are using the latest mirrors for your country.
</p>
</div>
</div>

<div id="outline-container-org89c7f8a" class="outline-2">
<h2 id="org89c7f8a"><span class="section-number-2">3.</span> Here are some additional tips for refreshing your mirrorlist:</h2>
<div class="outline-text-2" id="text-3">
<p>
You can use the <code>--country</code> flag to specify multiple countries. For example, to refresh the mirrorlist for the United States and Canada, you would run the following command:
</p>

<pre class="example">
reflector --country US,CA --latest 5 --sort rate --save /etc/pacman.d/mirrorlist
</pre>

<p>
You can use the <code>--latest</code> flag to specify the number of mirrors you want to keep. The default is 5.
You can use the <code>--sort</code> flag to specify how you want the mirrors to be sorted. The default is by rate. You can also sort by latency or last update.
You can use the <code>--save</code> flag to specify the file where you want the new mirrorlist to be saved. The default is /etc/pacman.d/mirrorlist.
</p>

<div id="comments"></div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ChanMo</p>
<p class="date">Created: 2023-07-07 五 15:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>